"use client";
import React, { useState } from "react";

export default function ResultUI() {
  const [isVisible, setIsVisible] = useState(true); // 컴포넌트 표시 여부를 관리하는 상태

  const handleClose = () => {
    setIsVisible(false); // 닫기 버튼을 누르면 컴포넌트가 사라짐
  };

  if (!isVisible) return null; // 컴포넌트가 숨겨졌을 때 아무것도 렌더링하지 않음

  return (
    <div className="relative bg-[#FFFFFF] shadow w-[494px] h-[146px] flex flex-col justify-center rounded-2xl p-[32px]">
      {/* 닫기 버튼 */}
      <button onClick={handleClose} className="absolute top-2 right-2 text-gray-400 hover:text-gray-600">
        ✕
      </button>

      <div className="flex items-center">
        <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path
            d="M20 0.5C16.1433 0.5 12.3731 1.64366 9.16639 3.78634C5.95963 5.92903 3.46027 8.97451 1.98436 12.5377C0.508449 16.1008 0.122284 20.0216 0.874696 23.8043C1.62711 27.5869 3.4843 31.0615 6.21143 33.7886C8.93855 36.5157 12.4131 38.3729 16.1957 39.1253C19.9784 39.8777 23.8992 39.4916 27.4623 38.0156C31.0255 36.5397 34.071 34.0404 36.2137 30.8336C38.3564 27.6269 39.5 23.8567 39.5 20C39.4945 14.83 37.4383 9.87322 33.7826 6.21745C30.1268 2.56167 25.1701 0.50546 20 0.5ZM28.5613 16.5613L18.0613 27.0613C17.9219 27.2007 17.7565 27.3114 17.5744 27.3868C17.3923 27.4623 17.1971 27.5012 17 27.5012C16.8029 27.5012 16.6077 27.4623 16.4256 27.3868C16.2435 27.3114 16.0781 27.2007 15.9388 27.0613L11.4388 22.5613C11.1573 22.2798 10.9992 21.898 10.9992 21.5C10.9992 21.102 11.1573 20.7202 11.4388 20.4387C11.7202 20.1573 12.102 19.9992 12.5 19.9992C12.8981 19.9992 13.2798 20.1573 13.5613 20.4387L17 23.8794L26.4388 14.4387C26.5781 14.2994 26.7436 14.1888 26.9257 14.1134C27.1078 14.038 27.3029 13.9992 27.5 13.9992C27.6971 13.9992 27.8923 14.038 28.0744 14.1134C28.2564 14.1888 28.4219 14.2994 28.5613 14.4387C28.7006 14.5781 28.8112 14.7436 28.8866 14.9257C28.962 15.1077 29.0008 15.3029 29.0008 15.5C29.0008 15.6971 28.962 15.8923 28.8866 16.0743C28.8112 16.2564 28.7006 16.4219 28.5613 16.5613Z"
            fill="#6100FF"
          />
        </svg>

        <p className="font-inter font-medium text-[20px] leading-[28px] ml-[10px]">프로젝트 검사완료</p>
      </div>

      <p className="mt-2 font-inter font-medium text-[18px] text-[#969696] leading-[28px] ml-[45px]">
        아래에서 출력된 결과를 확인하세요.
      </p>
    </div>
  );
}
